<?php

namespace Database\Seeders;

use App\Models\Answer;
use App\Models\Diagnosis;
use App\Models\DiagnosisQuestion;
use App\Models\Question;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class PatientSurveySeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        Question::truncate();
        Answer::truncate();

        $questions = [
            [ 'text' => 'ОКС', 'depends_on_answer_id' => null ], // 1

            [ 'text' => 'Тропонин?', 'depends_on_answer_id' => 1 ], // 2

            [ 'text' => 'Нарушение гемодинамики', 'depends_on_answer_id' => 3 ], // 3
            [ 'text' => 'Болевой синдром', 'depends_on_answer_id' => 3 ], // 4
            [ 'text' => 'Шок', 'depends_on_answer_id' => 4 ], // 5
            [ 'text' => 'Отек', 'depends_on_answer_id' => 4 ], // 6

            [ 'text' => 'Нарушение гемодинамики', 'depends_on_answer_id' => 2 ], // 7
            [ 'text' => 'Болевой синдром', 'depends_on_answer_id' => 2 ], // 8
            [ 'text' => 'Шок', 'depends_on_answer_id' => 12 ], // 9
            [ 'text' => 'Отек', 'depends_on_answer_id' => 12 ], // 10

            [ 'text' => 'ТЛТ', 'depends_on_answer_id' => 20 ], // 11

            [ 'text' => 'ТЛТ - Да', 'depends_on_answer_id' => 21 ], // 12

            [ 'text' => 'Нарушение гемодинамики', 'depends_on_answer_id' => 24 ], // 13
            [ 'text' => 'Болевой синдром', 'depends_on_answer_id' => 24 ], // 14
            [ 'text' => 'Положительная динамика на ЭКГ?', 'depends_on_answer_id' => 24 ], // 15

            [ 'text' => 'Шок', 'depends_on_answer_id' => 25 ], // 16 Не эффективный - Нарушение гемодинамики - Да
            [ 'text' => 'Отек', 'depends_on_answer_id' => 25 ], // 17 Не эффективный - Нарушение гемодинамики - Да

            [ 'text' => 'ТЛТ - Нет', 'depends_on_answer_id' => 22 ], // 18 Тлт - Нет

            [ 'text' => 'Нарушение гемодинамики', 'depends_on_answer_id' => 35 ], // 19 Тлт - нет - До 48 часов от начала заболевания
            [ 'text' => 'Болевой синдром', 'depends_on_answer_id' => 35 ], // 20 Тлт - нет - До 48 часов от начала заболевания
            [ 'text' => 'Положительная динамика на ЭКГ?', 'depends_on_answer_id' => 35 ], // 21 Тлт - нет - До 48 часов от начала заболевания

            [ 'text' => 'Шок', 'depends_on_answer_id' => 37 ], // 22 Тлт - нет - До 48 часов от начала заболевания - Нарушение гемодинамики - Да
            [ 'text' => 'Отек', 'depends_on_answer_id' => 37 ], // 23 Тлт - нет - До 48 часов от начала заболевания - Нарушение гемодинамики - Да

            [ 'text' => 'Нарушение гемодинамики', 'depends_on_answer_id' => 36 ], // 24 Тлт - нет - После 48 часов от начала заболевания
            [ 'text' => 'Болевой синдром', 'depends_on_answer_id' => 36 ], // 25 Тлт - нет - После 48 часов от начала заболевания
            [ 'text' => 'Положительная динамика на ЭКГ?', 'depends_on_answer_id' => 36 ], // 26 Тлт - нет - После 48 часов от начала заболевания

            [ 'text' => 'Шок', 'depends_on_answer_id' => 47 ], // 27 Тлт - нет - После 48 часов от начала заболевания - Нарушение гемодинамики - Да
            [ 'text' => 'Отек', 'depends_on_answer_id' => 47 ], // 28 Тлт - нет - После 48 часов от начала заболевания - Нарушение гемодинамики - Да
        ];

        $answers = [
            [ 'text' => 'Без подъема ST', 'score' => 0, 'question_id' => 1 ], // 1 ОКС

            [ 'text' => 'Положительный', 'score' => 0, 'question_id' => 2 ], // 2 Тропонин?
            [ 'text' => 'Отрицательный', 'score' => 0, 'question_id' => 2 ], // 3 Тропонин?

            [ 'text' => 'Да', 'score' => 0, 'question_id' => 3 ], // 4 Нарушение гемодинамики
            [ 'text' => 'Нет', 'score' => 0, 'question_id' => 3 ], // 5 Нарушение гемодинамики

            [ 'text' => 'Да', 'score' => 0, 'question_id' => 4 ], // 6 Болевой синдром
            [ 'text' => 'Нет', 'score' => 0, 'question_id' => 4 ], // 7 Болевой синдром

            [ 'text' => 'Да', 'score' => 0, 'question_id' => 5 ], // 8 Шок
            [ 'text' => 'Нет', 'score' => 0, 'question_id' => 5 ], // 9 Шок

            [ 'text' => 'Да', 'score' => 0, 'question_id' => 6 ], // 10 Отек
            [ 'text' => 'Нет', 'score' => 0, 'question_id' => 6 ], // 11 Отек

            [ 'text' => 'Да', 'score' => 0, 'question_id' => 7 ], // 12 Нарушение гемодинамики
            [ 'text' => 'Нет', 'score' => 0, 'question_id' => 7 ], // 13 Нарушение гемодинамики

            [ 'text' => 'Да', 'score' => 0, 'question_id' => 9 ], // 14 Шок
            [ 'text' => 'Нет', 'score' => 0, 'question_id' => 9 ], // 15 Шок

            [ 'text' => 'Да', 'score' => 0, 'question_id' => 10 ], // 16 Отек
            [ 'text' => 'Нет', 'score' => 0, 'question_id' => 10 ], // 17 Отек

            [ 'text' => 'Да', 'score' => 0, 'question_id' => 8 ], // 18 Болевой синдром
            [ 'text' => 'Нет', 'score' => 0, 'question_id' => 8 ], // 19 Болевой синдром

            [ 'text' => 'С подъемом ST', 'score' => 0, 'question_id' => 1 ], // 20 ОКС

            [ 'text' => 'Да', 'score' => 0, 'question_id' => 11 ], // 21 ТЛТ
            [ 'text' => 'Нет', 'score' => 0, 'question_id' => 11 ], // 22 ТЛТ

            [ 'text' => 'Эффективный', 'score' => 0, 'question_id' => 12 ], // 23 ТЛТ - Да
            [ 'text' => 'Не эффективный', 'score' => 0, 'question_id' => 12 ], // 24 ТЛТ - Да

            [ 'text' => 'Да', 'score' => 0, 'question_id' => 13 ], // 25 Не эффективный - Нарушение гемодинамики
            [ 'text' => 'Нет', 'score' => 0, 'question_id' => 13 ], // 26 Не эффективный - Нарушение гемодинамики

            [ 'text' => 'Да', 'score' => 0, 'question_id' => 16 ], // 27 Не эффективный - Нарушение гемодинамики - Да - Шок
            [ 'text' => 'Нет', 'score' => 0, 'question_id' => 16 ], // 28 Не эффективный - Нарушение гемодинамики - Да - Шок

            [ 'text' => 'Да', 'score' => 0, 'question_id' => 17 ], // 29 Не эффективный - Нарушение гемодинамики - Да - Отек
            [ 'text' => 'Нет', 'score' => 0, 'question_id' => 17 ], // 30 Не эффективный - Нарушение гемодинамики - Да - Отек

            [ 'text' => 'Да', 'score' => 0, 'question_id' => 14 ], // 31 Не эффективный - Болевой синдром
            [ 'text' => 'Нет', 'score' => 0, 'question_id' => 14 ], // 32 Не эффективный - Болевой синдром

            [ 'text' => 'Да', 'score' => 0, 'question_id' => 15 ], // 33 Не эффективный - Положительная динамика на ЭКГ?
            [ 'text' => 'Нет', 'score' => 0, 'question_id' => 15 ], // 34 Не эффективный - Положительная динамика на ЭКГ?

            [ 'text' => 'До 48 часов от начала заболевания', 'score' => 0, 'question_id' => 18 ], // 35 Тлт - нет
            [ 'text' => 'После 48 часов от начала заболевания', 'score' => 0, 'question_id' => 18 ], // 36 Тлт - нет

            [ 'text' => 'Да', 'score' => 0, 'question_id' => 19 ], // 37 Тлт - нет - До 48 часов от начала заболевания - Нарушение гемодинамики
            [ 'text' => 'Нет', 'score' => 0, 'question_id' => 19 ], // 38 Тлт - нет - До 48 часов от начала заболевания - Нарушение гемодинамики

            [ 'text' => 'Да', 'score' => 0, 'question_id' => 22 ], // 39 Тлт - нет - До 48 часов от начала заболевания - Нарушение гемодинамики - Да - Шок
            [ 'text' => 'Нет', 'score' => 0, 'question_id' => 22 ], // 40 Тлт - нет - До 48 часов от начала заболевания - Нарушение гемодинамики - Да - Шок

            [ 'text' => 'Да', 'score' => 0, 'question_id' => 23 ], // 41 Тлт - нет - До 48 часов от начала заболевания - Нарушение гемодинамики - Да - Отек
            [ 'text' => 'Нет', 'score' => 0, 'question_id' => 23 ], // 42 Тлт - нет - До 48 часов от начала заболевания - Нарушение гемодинамики - Да - Отек

            [ 'text' => 'Да', 'score' => 0, 'question_id' => 20 ], // 43 Тлт - нет - До 48 часов от начала заболевания - Болевой синдром
            [ 'text' => 'Нет', 'score' => 0, 'question_id' => 20 ], // 44 Тлт - нет - До 48 часов от начала заболевания - Болевой синдром

            [ 'text' => 'Да', 'score' => 0, 'question_id' => 21 ], // 45 Тлт - нет - До 48 часов от начала заболевания - Положительная динамика на ЭКГ?
            [ 'text' => 'Нет', 'score' => 0, 'question_id' => 21 ], // 46 Тлт - нет - До 48 часов от начала заболевания - Положительная динамика на ЭКГ?

            // Тлт - нет - После 48 часов от начала заболевания
            [ 'text' => 'Да', 'score' => 0, 'question_id' => 24 ], // 47 Тлт - нет - После 48 часов от начала заболевания - Нарушение гемодинамики
            [ 'text' => 'Нет', 'score' => 0, 'question_id' => 24 ], // 48 Тлт - нет - После 48 часов от начала заболевания - Нарушение гемодинамики

            [ 'text' => 'Да', 'score' => 0, 'question_id' => 27 ], // 49 Тлт - нет - После 48 часов от начала заболевания - Нарушение гемодинамики - Да - Шок
            [ 'text' => 'Нет', 'score' => 0, 'question_id' => 27 ], // 50 Тлт - нет - После 48 часов от начала заболевания - Нарушение гемодинамики - Да - Шок

            [ 'text' => 'Да', 'score' => 0, 'question_id' => 28 ], // 51 Тлт - нет - После 48 часов от начала заболевания - Нарушение гемодинамики - Да - Отек
            [ 'text' => 'Нет', 'score' => 0, 'question_id' => 28 ], // 52 Тлт - нет - После 48 часов от начала заболевания - Нарушение гемодинамики - Да - Отек

            [ 'text' => 'Да', 'score' => 0, 'question_id' => 25 ], // 53 Тлт - нет - После 48 часов от начала заболевания - Болевой синдром
            [ 'text' => 'Нет', 'score' => 0, 'question_id' => 25 ], // 54 Тлт - нет - После 48 часов от начала заболевания - Болевой синдром

            [ 'text' => 'Да', 'score' => 0, 'question_id' => 26 ], // 55 Тлт - нет - После 48 часов от начала заболевания - Положительная динамика на ЭКГ?
            [ 'text' => 'Нет', 'score' => 0, 'question_id' => 26 ], // 56 Тлт - нет - После 48 часов от начала заболевания - Положительная динамика на ЭКГ?
        ];

        Answer::insert($answers);
        Question::insert($questions);

        // Связь диагноз ОКС - вопрос
        $diagnosis = Diagnosis::where("code", 'like', 'I%')->get();
        foreach ($diagnosis as $diag) {
            foreach ($questions as $key => $question) {
                DiagnosisQuestion::create([
                    'question_id' => $key + 1,
                    'diagnosis_id' => $diag->id,
                ]);
            }
        }
    }
}
